# Задача 1. Лямбда-функция

### Описание
Напишите программу, которая все нечётные элементы массива (`std::vector`) умножает на 3 с помощью лямбда-функции.

Циклы использовать не нужно.

### Пример работы программы
```
Входные данные:  4 7 9 14 12 
Выходные данные: 4 21 27 14 12
```
#### Подсказки

Не читайте этот раздел сразу. Попытайтесь сначала решить задачу самостоятельно :)

<details>

<summary>Что использовать для решения.</summary>

Подсказка 1. Прочитать про вектор можно [по ссылке](https://ru.cppreference.com/w/cpp/container/vector). Вам понадобятся методы `begin` и `end`.

Подсказка 2. Можно использовать функцию `std::for_each`.

</details>

# Задача 2. std::variant

### Описание
std::variant бывает удобно применять в разработке парсеров.

Например, есть некоторая универсальная функция, которая может возвращать значения разных типов в зависимости от контекста.
В этом задании вам нужно использовать простую функцию, которая может возвращать число, строку или массив чисел. 

```C++
std::variant<int, std::string, std::vector<int>> get_variant() {
	std::srand(std::time(nullptr));
	int random_variable = std::rand() % 3;

	std::variant<int, std::string, std::vector<int>> result;
	switch (random_variable)
	{
	case 0:
		result = 5;
		break;
	case 1:
		result = "string";
		break;
	case 2:
		result = std::vector<int>{ 1, 2, 3, 4, 5 };
		break;
	default:
		break;
	}
	return result;
}
```

Вам нужно написать обработку результата этой функции следующим образом:
* Если в результате функции содержится int, то вывести число, умноженное на 2.
* Если в результате функции содержится строка, то просто вывести её в консоль.
* Если в результате функции содержится вектор чисел, то вывести все его элементы в консоль.


#### Подсказки

Не читайте этот раздел сразу. Попытайтесь сначала решить задачу самостоятельно :)

<details>

<summary>Какие функции использовать.</summary>

Используйте функции `std::holds_alternative`, `std::get` или `std::get_if`.

</details>

# Задача 3*. Операции над углами

### Описание
Иногда бывает нужно хранить созданные лямбда-функции. Для этого есть тип [std::function](https://en.cppreference.com/w/cpp/utility/functional/function).

В этой задаче вам дан массив значений углов. Нужно вывести их синус и косинус.
Сделать это нужно так, чтобы при необходимости вывода новых операций с этими углами, например, если захотим посчитать тангенс, не пришлось изменять код вывода.

```C++
for (const auto& angle : angles) {
	std::cout << angle << ": ";
	for (const auto& function : functions)
		function(angle);
	std::cout << std::endl;
}
```

### Пример правильной работы программы
```
[Входные данные]: 30 * 3.1415926 / 180, 60 * 3.1415926 / 180, 90 * 3.1415926 / 180 // перевод из градусов в радианы
[Выходные данные]:
0.523599: sin: 0.5 cos: 0.866025
1.0472: sin: 0.866025 cos: 0.5
1.5708: sin: 1 cos: 2.67949e-08
```


#### Подсказки

Не читайте этот раздел сразу. Попытайтесь сначала решить задачу самостоятельно :)

<details>

<summary>Что использовать для решения.</summary>

Нужно правильно понять, какая сигнатура будет у лямда-функций, и правильно их сохранить.

</details>
